load-test.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 10
      arrivalRate: 200
  processor: "./load-funcs.js"
scenarios:
  - name: "Deliver static assets & make get request for 1 video"
    flow:
      - function: "generateTestVars"
      - get:
          url: "/{{ id }}"
  - name: "Get 1 description"
    flow:
      - function: "generateTestVars"
      - get:
          url: "/api/descriptions"
          qs:
            id: {{ id }}
  - name: "Get paginated descriptions"
    flow:
      - get:
          url: "/api/descriptions"
          qs:
            page: 5
            pageSize: 10
  - name: "Get 1 comment"
    flow:
      - function: "generateTestVars"
      - get:
          url: "/api/comments"
          qs:
            id: {{ id }}
  - name: "Get paginated comments"
    flow:
      - get:
          url: "/api/comments"
          qs:
            page: 5
            pageSize: 10
  - name: "Post 1 comment"
    flow:
      - post:
          url: "/api/comments"
          json:
            videoId: 10000000
            text: "Inserted by Artillery!!!"
            userId: 10
            date: "2019-02-12T00:02:05.000Z"