load-test.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 60
      arrivalRate: 250
scenarios:
  - name: "Get 1 description"
    flow:
      - get:
          url: "/api/descriptions"
          qs:
            id: 5
  - name: "Get paginated descriptions"
    flow:
      - get:
          url: "/api/descriptions"
          qs:
            page: 5
            pageSize: 10
  - name: "Get 1 comment"
    flow:
      - get:
          url: "/api/comments"
          qs:
            id: 5
  - name: "Get paginated comments"
    flow:
      - get:
          url: "/api/comments"
          qs:
            page: 5
            pageSize: 10
  - name: "Post 1 comment"
    flow:
      - post:
          url: "/api/comments"
          json:
            videoId: 1
            text: "Incoming fire!"
            userId: 10
            date: "2019-02-12T00:02:05.000Z"